; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-5-4-285)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p1-0 - location
	p2-0 - location
	p2-1 - location
	p0-3 - location
	p4-0 - location
	p3-2 - location
	p3-4 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s2)
	(at driver3 s4)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s0)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s2)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s3)
	(at package2 s2)
	(at package3 s4)
	(at package4 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 62)
	(= (time-to-walk p1-0 s1) 62)
	(= (time-to-walk s0 p1-0) 19)
	(= (time-to-walk p1-0 s0) 19)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 43)
	(= (time-to-walk p2-0 s2) 43)
	(= (time-to-walk s0 p2-0) 31)
	(= (time-to-walk p2-0 s0) 31)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 15)
	(= (time-to-walk p2-1 s2) 15)
	(= (time-to-walk s1 p2-1) 29)
	(= (time-to-walk p2-1 s1) 29)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 14)
	(= (time-to-walk p0-3 s0) 14)
	(= (time-to-walk s3 p0-3) 67)
	(= (time-to-walk p0-3 s3) 67)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 62)
	(= (time-to-walk p4-0 s4) 62)
	(= (time-to-walk s0 p4-0) 66)
	(= (time-to-walk p4-0 s0) 66)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 9)
	(= (time-to-walk p3-2 s3) 9)
	(= (time-to-walk s2 p3-2) 66)
	(= (time-to-walk p3-2 s2) 66)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 18)
	(= (time-to-walk p3-4 s3) 18)
	(= (time-to-walk s4 p3-4) 54)
	(= (time-to-walk p3-4 s4) 54)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 36)
	(= (time-to-drive s2 s1) 36)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 7)
	(= (time-to-drive s4 s1) 7)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 1)
	(= (time-to-drive s3 s2) 1)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 19)
	(= (time-to-drive s1 s0) 19)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 64)
	(= (time-to-drive s2 s0) 64)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 44)
	(= (time-to-drive s3 s0) 44)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 40)
	(= (time-to-drive s1 s3) 40)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 53)
	(= (time-to-drive s4 s3) 53)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver3 s2)
	(at truck1 s1)
	(at truck2 s3)
	(at truck3 s0)
	(at package1 s2)
	(at package2 s0)
	(at package3 s0)
	(at package4 s1)
	))

(:metric minimize (+ (* 4 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 1 of 8
2. (walk driver3 s4 p3-4)
   deleted: (at driver3 s4)
   added: (at driver3 p3-4)
   goals met: 1 of 8
3. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 8
4. (load-truck package4 truck1 s2)
   deleted: (at package4 s2)
   added: (in package4 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 1 of 8
5. (walk driver3 p3-4 s3)
   deleted: (at driver3 p3-4)
   added: (at driver3 s3)
   goals met: 1 of 8
6. (walk driver3 s3 p3-2)
   deleted: (at driver3 s3)
   added: (at driver3 p3-2)
   goals met: 1 of 8
7. (walk driver3 p3-2 s2)
   deleted: (at driver3 p3-2)
   added: (at driver3 s2)
   goals met: 2 of 8
8. (drive-truck truck1 s2 s1 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 0 to 468
   goals met: 3 of 8
9. (unload-truck package4 truck1 s1)
   deleted: (in package4 truck1)
   added: (at package4 s1)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 4 of 8
10. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 4 of 8
11. (board-truck driver2 truck2 s1)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 4 of 8
12. (unload-truck package2 truck1 s1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 4 of 8
13. (load-truck package2 truck2 s1)
   deleted: (at package2 s1)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 4 of 8
14. (drive-truck truck2 s1 s3 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 468 to 908
   goals met: 5 of 8
15. (load-truck package1 truck2 s3)
   deleted: (at package1 s3)
   added: (in package1 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 5 of 8
16. (drive-truck truck2 s3 s2 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 908 to 921
   goals met: 4 of 8
17. (unload-truck package1 truck2 s2)
   deleted: (in package1 truck2)
   added: (at package1 s2)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 5 of 8
18. (drive-truck truck2 s2 s0 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (fuel-used) from 921 to 1625
   goals met: 5 of 8
19. (unload-truck package2 truck2 s0)
   deleted: (in package2 truck2)
   added: (at package2 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 8
20. (drive-truck truck2 s0 s3 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 1625 to 2065
   goals met: 7 of 8
21. (drive-truck truck2 s3 s4 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   changed: (fuel-used) from 2065 to 2595
   goals met: 6 of 8
22. (load-truck package3 truck2 s4)
   deleted: (at package3 s4)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 6 of 8
23. (drive-truck truck2 s4 s3 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (fuel-used) from 2595 to 3178
   goals met: 7 of 8
24. (drive-truck truck2 s3 s0 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 3178 to 3662
   goals met: 6 of 8
25. (unload-truck package3 truck2 s0)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 7 of 8
26. (drive-truck truck2 s0 s3 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 3662 to 4102
   goals met: 8 of 8
